payment/fixtures/contacts/cardData.json

{
  "method": "CREDIT_CARD",
  "amount": 20,
  "total": 20,
  "installments": "1",
  "product_id": "35008",
  "products": [
    {
      "product_id": 35008,
      "product_offer": "aRAism"
    }
  ],
  "name": "Tanielson moura",
  "email": "teste@mail.com",
  "cellphone": "+554444444444",
  "document": "707.952.041-08",
  "uuid": "c9423eb5-07d4-4864-b7eb-f05bce8092b6",
  "country_code": "BR",
  "zipcode": null,
  "street": "",
  "number": 0,
  "complement": "",
  "neighborhood": "",
  "city": "",
  "state": "",
  "language": "pt",
  "metas": {},
  "cards": [
    {
      "id": "798EAE7D9040452CAC08260181732A00",
      "last_digits": "4444",
      "first_digits": "555555",
      "customer": null,
      "amount": "20.00",
      "total": "20.00"
    }
  ],
  "currency_data": {
    "local_currency": "BRL",
    "base_currency": "BRL"
  },
  "gateway": "IUGU",
  "client_id": null
}
